import numpy as np
from objective_method.critic import Critic

# 1 建立critic对象
critic = Critic()

# 2 样本数据,有6个样本，8个评价指标
data = [[162.519, 1069.70, 55.789, 196.906, 3894.9, 6470.51, 2.635, 1.55],
        [113.073, 763.16, 70.677, 61.947, 1033.9, 7490.32, 1.986, 0.59],
        [245.158, 3962.42, 163.893, 178.782, 536.0, 2288.19, 1.276, 0.14],
        [112.376, 1738.90, 70.731, 104.945, 147.6, 1522.79, 0.242, 0.08],
        [143.599, 1249.30, 103.652, 54.426, 119.4, 342.36, 0.209, 0.05],
        [105.688, 1337.80, 74.417, 58.843, 220.5, 746.94, 0.223, 0.13]]
data = np.array(data)
# 3 归一化
X, min_val, max_val = critic.min_max_scaler_pos(data)

# 4 运行算法计算权重
W = critic.fit(X)

print(f"权重W = {W}")

# 计算样本数据评分
test = [117.028, 2532.60, 90.876, 71.531, 315.6, 1301.04, 0.977, 0.17]
X = np.array(test)
X, _, _ = critic.min_max_scaler_pos(X, min_val, max_val)  # 标准化
Z = critic.predict(X)
print(f"预测得分 = {Z}")

"""例子结果
权重W = [0.10545778 0.14350956 0.16076511 0.10158071 0.11258282 0.14563603
 0.10943079 0.12103722]
预测得分 = 0.2220292263549286
"""